{
  "changeLog": [
    {
      "version": "1.0.4",
      "details": "Version 1.0.4 of dcl-edit is now available. To update, just run npm i dcl-edit -g\n\nThis release of dcl-edit features support for the Custom Component Markup. You can write your own components for dcl-edit now. Take a look at the documentation: <u><color=\"blue\"><link=\"CustomComponents\">https://dcl-edit.com/custom-component-markup/</link></color></u>\n\nWhat's Changed\n\nNew features:\n\nAdd Custom Component Markup\n\tWhen parenting entities, the transform of the child entity stays the same in world space.\n\tTranslate on plane handles are now always on the camera facing side of the gizmo.\n\nBug fixes:\n\nContext Menu now scales with UI Scaling setting. For example, when right-clicking in the hierarchy, the menu that pops up will scale properly with the UI Scaling setting in the Settings menu.\nWhen the edge of the scene view was clicked to resize the panel, the currently selected entity might have been deselected."
    },
    {
      "version": "1.0.3",
      "details": "Version 1.0.3 of dcl-edit is now available. To update, just run npm i dcl-edit -g\n\nWe are happy to announce, that we have added support for Linux and Mac. DLC-Edit can now be used on Windows, Linux, and Mac. Please let us know if you encounter any error, especially on those new platforms.\n\nNew command line options:\nuse the -h option to get a list of all available options\nuse -v to get the version number\nuse -p to specify a project folder, when your working directory is not the Decentraland project root\nsome people have problems with the scene view turning white. This seems to be a problem with the graphics API used. You can now use the -g option, to select a different graphics API. Use -h to see, which APIs are available on your platform.\n\nBug fixes:\nWhen writing an invalid value in an input field and then clicking on another input field, the invalid value stays in the first input field.\nWhen there is an error with the asset in a GltfShape, it will show an Error model instead of the actual model. This error model could not be clicked.\n\nOther changes:\nthe \"assets\" folder is now shown as \"Assets\" in the Asset Browser"
    },
    {
      "version": "1.0.2",
      "details": "Version 1.0.2 of dcl-edit is now available. To update, just run npm i dcl-edit -g\n\nWhat's Changed\n\nNew features:\n- Scenes are visible in the asset browser. Also, when using scenes in scenes, you don't need to manually type in the Guid string. Instead, you just select the Scene in the asset browser\n- Add the node_modules folder as an asset resource. This means, you can share and get assets via npm packages\n- While using a gizmo tool, you can hold ctrl to temporarily enable snapping when snapping is disabled and vice versa \n- The name of the current scene is shown in the tab handle\n- You can use . or , as decimal separator, making the numpad easier to use on some non-English keyboards\n- While changing an entity by dragging a gizmo, you can press escape on your keyboard to abort the change\n- To increase accessibility, you can change the hierarchy without using drag and drop. Just select an entity and right click another one\n\nBug fixes:\n- Some hotkeys trigger on-release instead of on-press\n- When adding an asset, then undoing it, the gizmo took stays visible\n- When dragging assets into the scene too quickly, it might not be placed correctly\n\nOther changes:\n- Fixed some spacing around asset browser buttons\n- Removed image assets, because they don't have any use yet. They will be reintroduced at a later point\n- .dclasset files now also have the original extension in the name. The asset some_asset.glb used to have a .dclasset file called some_asset.dclasset. Now that file will be called some_asset.glb.dclasset"
    }
  ]
}